# Taps
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "teamookla/speedtest"

# Brews (packages)
brew "bat"
brew "exa"
brew "gcc"
brew "git"
brew "httpie"
brew "mas"
brew "node"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "eth-p/software/bat-extras"
brew "teamookla/speedtest/speedtest"

# Casks (Applications)
cask "adguard"
cask "alfred"
cask "aerial"
cask "appcleaner"
cask "docker"
cask "firefox"
cask "fork"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "iterm2"
cask "notion"
cask "postman"
cask "spotify"
cask "tutanota"
cask "typora"
cask "visual-studio-code"
cask "webpquicklook"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "Hush", id: 1544743900
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "NordVPN IKE", id: 1116599239
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "uBlacklist for Safari", id: 1547912640