# Taps
tap "cloudflare/cloudflare"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Brews (packages)
brew "bat"
brew "exa"
brew "gcc"
brew "git"
brew "mas"
brew "node"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "cloudflare/cloudflare/cloudflared"
brew "eth-p/software/bat-extras"

# Casks (Applications)
cask "adguard"
cask "aerial"
cask "aldente"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "cleanshot"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "fork"
cask "hyper"
cask "iina"
cask "notion"
cask "postman"
cask "raycast"
cask "runjs"
cask "sensei"
cask "visual-studio-code"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Dark Reader for Safari", id: 1438243180
mas "Hush", id: 1544743900
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PasteNow", id: 1552536109
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "PSWD", id: 1541482816
mas "Slack", id: 803453959
mas "Step Two", id: 1448916662
mas "Taio", id: 1527036273
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Wipr", id: 1320666476
