# Taps
tap "cloudflare/cloudflare"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "teamookla/speedtest"

# Brews (packages)
brew "bat"
brew "exa"
brew "gcc"
brew "git"
brew "httpie"
brew "mas"
brew "node"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "cloudflare/cloudflare/cloudflared"
brew "eth-p/software/bat-extras"
brew "teamookla/speedtest/speedtest"

# Casks (Applications)
cask "aerial"
cask "aldente"
cask "dash"
cask "docker"
cask "figma"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "fork"
cask "hyper"
cask "iina"
cask "imageoptim"
cask "lastfm"
cask "raycast"
cask "squirrel"
cask "stats"
cask "webpquicklook"

# Mac App Store
mas "1Password 7", id: 1333542190
mas "Dark Reader for Safari", id: 1438243180
mas "Hush", id: 1544743900
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NordVPN IKE", id: 1116599239
mas "PasteNow", id: 1552536109
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "Step Two", id: 1448916662
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
